<?php

class User
{
    private $name;
    private $id;
    private $dateOfRegister;
    private $email;
    private $password;

//    что должна делать:
//1 - сохранение модели в БД
// 2-  получение модели из базы и заполнение ее данными.
//2 - регистрация. При регистрации проверяется:
//длина пароля (не менее 4х символов)
//требуется ввод пароля дважды
//введенные пароли должны совпадать
//3 - авторизацию пользователя. Пользователь авторизуется по email и паролю. Пароль хранится в зашифрованном
//виде в БД
//



}